// stubs for network communications
#include <sys/types.h>
#include <sys/socket.h>
#include <sys/time.h>
#include <netinet/in.h>
#include <netdb.h>
#include <zlib.h>
#include "stubs.h"
#include "Synchronized.h"
#include "Task.h"
#include "DriverStation.h"
#include "NetworkCommunication/FRCComm.h"
#include "NetworkCommunication/UsageReporting.h"
#include "CAN/can_proto.h"

uint8_t fakeMAC[] = { 0x00, 0x80, 0x2f, 0x11, 0xd8, 0x2a };
char commVersion[] = "06300800";

///////////////////////////////////////////////////////////////////////////////
//
// libpcap replacement for logging traffic to pcap file
//
///////////////////////////////////////////////////////////////////////////////

class pcap {
private:
    FILE * m_file;
    SEM_ID m_mutex;

public:
    pcap( const char *name );
    ~pcap();

    void write_record( const sockaddr_in *src, const sockaddr_in *dst,
    			const char *data, int len );
};

pcap::pcap( const char *name )
{
    m_file = fopen(name, "wb");
    if (!m_file) {
	perror("pcap::fopen");
	abort();
    }

    m_mutex = semMCreate(SEM_Q_PRIORITY | SEM_DELETE_SAFE | SEM_INVERSION_SAFE);

#pragma pack(push,1)
    struct pcap_hdr {
	uint32_t magic_number;
	uint16_t version_major;
	uint16_t version_minor;
	int32_t  thiszone;
	uint32_t sigfigs;
	uint32_t snaplen;
	uint32_t network;
    } hdr;
#pragma pack(pop)

    hdr.magic_number = 0xa1b2c3d4;
    hdr.version_major = 2;
    hdr.version_minor = 4;
    hdr.thiszone = 0;
    hdr.sigfigs = 0;
    hdr.snaplen = 1500;
    hdr.network = 1; // Ethernet

    fwrite((char *)&hdr, sizeof hdr, 1, m_file);
}

void pcap::write_record( const sockaddr_in *src, const sockaddr_in *dst,
			 const char *packet, int len )
{
    Synchronized sync(m_mutex);

#pragma pack(push,1)
    struct pcaprec_hdr {
	uint32_t ts_sec;
	uint32_t ts_usec;
	uint32_t incl_len;
	uint32_t orig_len;
    } hdr;
#pragma pack(pop)

#pragma pack(push,1)
    struct ether_hdr {
	uint8_t dst[6];
	uint8_t src[6];
	uint16_t type;
    } eth;
#pragma pack(pop)

#pragma pack(push,1)
    struct ip_hdr {
	uint8_t ver;
	uint8_t dscp;
	uint16_t iplen;
	uint16_t id;
	uint16_t flags;
	uint8_t ttl;
	uint8_t proto;
	uint16_t cksum;
	uint32_t srcip;
	uint32_t dstip;
    } ip;
#pragma pack(pop)

#pragma pack(push,1)
    struct udp_hdr {
	uint16_t srcport;
	uint16_t dstport;
	uint16_t udplen;
	uint16_t cksum;
    } udp;
#pragma pack(pop)

    int udplen = len + sizeof (udp);
    int iplen = udplen + sizeof (ip);
    int ethlen = iplen + sizeof (eth);

    gettimeofday((struct timeval *)&hdr.ts_sec, NULL);
    hdr.incl_len = ethlen;
    hdr.orig_len = ethlen;

    fwrite((char *)&hdr, sizeof hdr, 1, m_file);

    memset(eth.dst, 0, sizeof eth.dst);
    memset(eth.src, 0, sizeof eth.src);
    eth.type = htons(0x0800);

    fwrite((char *)&eth, sizeof eth, 1, m_file);

    ip.ver = 0x45;
    ip.dscp = 0;
    ip.iplen = htons(iplen);
    ip.id = 0;
    ip.flags = 0;
    ip.ttl = 7;
    ip.proto = IPPROTO_UDP;
    ip.cksum = 0;
    ip.srcip = src->sin_addr.s_addr;
    ip.dstip = dst->sin_addr.s_addr;

    fwrite((char *)&ip, sizeof ip, 1, m_file);

    udp.srcport = src->sin_port;
    udp.dstport = dst->sin_port;
    udp.udplen = htons(udplen);
    udp.cksum = 0;

    fwrite((char *)&udp, sizeof udp, 1, m_file);

    fwrite((char *)packet, len, 1, m_file);
    fflush(m_file);
}

pcap::~pcap()
{
    // can't use Synchronized here since we need to destroy the semaphore
    //   without releasing it
    semTake(m_mutex, WAIT_FOREVER);
    fclose(m_file);
    semDelete(m_mutex);
}

///////////////////////////////////////////////////////////////////////////////
//
// network communication with the driver station and/or FMS
//
///////////////////////////////////////////////////////////////////////////////

#define	ROBOT_ADDR	0x0a0e1902
#define	ROBOT_RECV_PORT	1110
#define	ROBOT_SEND_PORT	1025
#define	DS_REPLY_PORT	1150

extern "C" void FRC_NetworkCommunicationInitialize();

class FNC // FRC_NetworkCommunication
{
private:
    friend void FRC_NetworkCommunicationInitialize();
    friend void setNewDataSem( SEM_ID );
    friend STATUS waitForDS();

    FNC();
    void SetNewDataSem( SEM_ID );

public:
    ~FNC();

private:
    pcap *m_pcap;

    int m_recvSocket;
    sockaddr_in m_recvAddr;

    int m_sendSocket;
    sockaddr_in m_sendAddr;

    Task *m_commTask;
    static void FRCCommTask( FNC * );

    SEM_ID m_dataAvailable;
    SEM_ID m_dataMutex;

public:
#pragma pack(push,1)
    // BEGIN: Definitions from DriverStationEnhancedIO
    // BEGIN: Definitions from the Cypress firmware
    typedef struct
    {
	uint16_t digital;
	uint16_t digital_oe;
	uint16_t digital_pe;
	uint16_t pwm_compare[4];
	uint16_t pwm_period[2];
	uint8_t dac[2];
	uint8_t leds;
	union
	{
	    struct
	    {
// This uses __BYTE_ORDER__ as a stand-in for "__BITFIELD_PACKING_ORDER__"
// (which is not defined).  It gives the intended result for gcc/g++ on
// PPC and x86 architectures but may not be correct for other compilers
// or even gcc with other processors.

#if (__BYTE_ORDER__ == __ORDER_BIG_ENDIAN__)
		// Bits are inverted from cypress fw because of big-endian!
		uint8_t pwm_enable : 4;
		uint8_t comparator_enable : 2;
		uint8_t quad_index_enable : 2;
#elif (__BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__)
		uint8_t quad_index_enable : 2;
		uint8_t comparator_enable : 2;
		uint8_t pwm_enable : 4;
#else
#error __BYTE_ORDER__ must be __ORDER_BIG_ENDIAN__ or __ORDER_LITTLE_ENDIAN__
#endif // __BYTE_ORDER__
	    };
	    uint8_t enables;
	};
	uint8_t fixed_digital_out;
    } output_t;  //data to IO (23 bytes)

    static void SwapDSEIOOutput( output_t *pOutput );

    typedef struct
    {
	uint8_t api_version;
	uint8_t fw_version;
	int16_t analog[8];
	uint16_t digital;
	int16_t accel[3];
	int16_t quad[2];
	uint8_t buttons;
	uint8_t capsense_slider;
	uint8_t capsense_proximity;
    } input_t;	//data from IO (33 bytes)
    // END: Definitions from the Cypress firmware

    static void SwapDSEIOInput( input_t *pInput );

    // Dynamic block definitions
    typedef struct
    {
	uint8_t size; // Must be 25 (size remaining in the block not counting the size variable)
	uint8_t id; // Must be 18
	output_t data;
	uint8_t flags;
    } status_block_t;

    typedef struct
    {
	uint8_t size; // Must be 34
	uint8_t id; // Must be 17
	input_t data;
    } control_block_t;
#pragma pack(pop)

    // END: Definitions from DriverStationEnhancedIO

private:
    STATUS Recv();

#define FRCCCDSIZE sizeof (FRCCommonControlData) // 80
#define	FRCEXTDSIZE 940

#pragma pack(push,1)
    struct FRCRecvPkt {			// received data in network order...
	FRCCommonControlData ctrl;	// common control data: 80 bytes
	char extData[FRCEXTDSIZE];	// extension data: up to 940 bytes
	uint32_t crc;			// 32-bit CRC
    } m_recvPkt;
#pragma pack(pop)

    sockaddr_in m_fromAddr;		// sending driver station's address
    FRCCommonControlData m_recvData;	// control data in host byte order
    uint8_t m_extData[FRCEXTDSIZE];	// dynamic data in unknown byte order

public:
    int GetCommonControlData( FRCCommonControlData *data );
    int GetDynamicControlData( uint8_t type, char *dynamicData, int32_t maxLength );

public:
    // keep a local copy of user data to be sent to the DS
    void ObserveUserProgramStarting();
    void ObserveUserProgramDisabled();
    void ObserveUserProgramAutonomous();
    void ObserveUserProgramTeleop();
    void ObserveUserProgramTest();
    int SetStatusData( float battery, uint8_t dsDigitalOut, uint8_t updateNumber,
		        const char *userDataHigh, int userDataHighLength,
		        const char *userDataLow, int userDataLowLength,
			int wait_ms );

private:
    uint16_t m_mode;

    float m_battery;
    uint8_t m_dsDigitalOut;
    uint8_t m_updateNumber;

    char *m_userDataHigh;
    uint32_t m_userDataHighLength;

    void FreeUserDataHigh();

    char *m_userDataLow;
    uint32_t m_userDataLowLength;

    void FreeUserDataLow();

public:
    int SetErrorData( const char *errors, int errorsLength, int wait_ms );

private:
    char *m_userErrMsg;
    uint32_t m_userErrMsgLength;

    void FreeErrorData();

public:
    // keep a local copy of enhanced I/O data
    // until it can be sent back to the DS
    int OverrideIOConfig( const char *ioConfig, int wait_ms );

private:
    char *m_eioConfig;
    uint32_t m_eioConfigLength;

    void FreeEIOConfig();

public:
    int SetLCDData( const char *lcdData, int lcdDataLength,
			   int wait_ms );
    char *m_lcdData;
    uint32_t m_lcdDataLength;

    void FreeLCDData();

private:
    int Send();

#pragma pack(push,1)
    struct FRCStatusPkt {
/*000*/	union {
		uint8_t control;

// This uses __BYTE_ORDER as a stand-in for "__BITFIELD_PACKING_ORDER"
// (which is not defined).  It gives the intended result for gcc/g++ on
// PPC and x86 architectures but may not be correct for other compilers
// or even gcc with other processors.

#if (__BYTE_ORDER__ == __ORDER_BIG_ENDIAN__)
		struct {
			uint8_t reset : 1;
			uint8_t notEStop : 1;
			uint8_t enabled : 1;
			uint8_t autonomous : 1;
			uint8_t fmsAttached : 1;
			uint8_t resync : 1;
			uint8_t test : 1;
			uint8_t checkVersions : 1;
		};
#elif (__BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__)
		struct {
			uint8_t checkVersions : 1;
			uint8_t test : 1;
			uint8_t resync : 1;
			uint8_t fmsAttached : 1;
			uint8_t autonomous : 1;
			uint8_t enabled : 1;
			uint8_t notEStop : 1;
			uint8_t reset : 1;
		};
#else
#error __BYTE_ORDER__ must be __ORDER_BIG_ENDIAN__ or __ORDER_LITTLE_ENDIAN__
#endif
	};

/*001*/	uint8_t battery[2];		// 2 bytes, scaled integer
/*003*/	uint8_t dsDigitalOut;		// DS digital outputs
/*004*/	uint8_t unknown1[4];
/*008*/	uint16_t teamID;		// copy of team ID from DS
/*00A*/	uint8_t macAddr[6];		// cRIO MAC address
/*010*/	char versionData[8];		// FRC comm protocol version
/*018*/	uint8_t unknown2[4];
/*01C*/ uint16_t mode;			// robot operating mode
/*01E*/	uint16_t packetIndex;		// copied from DS control packet
/*020*/	uint8_t updateNumber;		// from setStatusData()
/*021*/	uint8_t userData[911];		// contains:
					// user data high len (4 bytes)
					// user data high (n bytes)
					// error string len (4 bytes)
					// error string (n bytes)
					// user data low len (4 bytes)
					// user data low (n bytes)
					// ...or as much as will fit
/*3B0*/	uint8_t sysstat[40];		// system status data
/*3D8*/	uint8_t eioConfig[36];		// DSEIO status_block_t
/*3FC*/	uint32_t crc;
/*400*/	uint8_t lcdData[USER_DS_LCD_DATA_SIZE];	// optional
    } m_sendPkt;
#pragma pack(pop)

    sockaddr_in m_toAddr;
    uint32_t m_sendPktLength;

private:
    DISALLOW_COPY_AND_ASSIGN(FNC);
};


static FNC *netCommObj = NULL;

extern "C" void FRC_NetworkCommunicationInitialize()
{
    if (!netCommObj) {
	netCommObj = new FNC();
    }
}

FNC::FNC()
{
    m_pcap = new pcap("robot.pcap");

    m_recvSocket = socket( AF_INET, SOCK_DGRAM, IPPROTO_UDP );
    if (m_recvSocket == -1) {
	perror("socket");
	abort();
    }

    m_recvAddr.sin_family = AF_INET;
    m_recvAddr.sin_addr.s_addr = htonl(ROBOT_ADDR);
    m_recvAddr.sin_port = htons(ROBOT_RECV_PORT);

    if (bind(m_recvSocket, (struct sockaddr *)&m_recvAddr, sizeof m_recvAddr) == -1) {
	perror("bind");
	abort();
    }

    m_sendSocket = socket( AF_INET, SOCK_DGRAM, IPPROTO_UDP );
    if (m_sendSocket == -1) {
	perror("socket");
	abort();
    }

    m_sendAddr.sin_family = AF_INET;
